tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "bat"
brew "capnp"
brew "deno"
brew "difftastic"
brew "dotnet"
brew "glow"
brew "go"
brew "graphviz"
brew "lz4"
brew "xz"
brew "zstd"
brew "glib"
brew "cmake"
brew "llvm"
brew "coreutils"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "gnu-tar"
brew "readline"
brew "gnupg"
brew "htop"
brew "jq"
brew "libffi"
brew "libyaml"
brew "maven"
brew "neovim"
brew "nushell"
brew "nvm"
brew "oath-toolkit"
brew "openjdk@11"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.9"
brew "rbenv"
brew "ripgrep"
brew "ruby-build"
brew "starship"
brew "tmux"
brew "urlview"
brew "watchman"
brew "zellij"
brew "zola"
brew "zsh-syntax-highlighting"
cask "finch" if OS.mac?
cask "alacritty" if OS.mac?
cask "rectangle" if OS.mac?
cask "font-fira-code"
cask "font-fira-code-nerd-font"
