tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "bat"
brew "lz4"
brew "xz"
brew "zstd"
brew "glib"
brew "cmake"
brew "coreutils"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "gnu-tar"
brew "readline"
brew "gnupg"
brew "htop"
brew "maven"
brew "neovim"
brew "nushell"
brew "nvm"
brew "oath-toolkit"
brew "openjdk@11"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.9"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup-init"
brew "starship"
brew "tmux"
brew "urlview"
brew "watchman"
brew "zellij"
cask "finch" if OS.mac?
cask "alacritty" if OS.mac?
cask "rectangle" if OS.mac?
cask "font-fira-code"
cask "font-fira-code-nerd-font"
